In [1]:
import pandas as pd

In [14]:
example = pd.read_csv("C:/Users/USUARIO/OneDrive/Desktop/Análisis de Datos/Módulo Técnico/example_ventas.csv")

In [15]:
print(example)

         Fecha   Region      Producto Vendedor         Ventas  Unnamed: 5  \
0   31/01/2024  Central    Accesorios    David    8,287.00 €          NaN
1   01/02/2024  Central    Accesorios    Karen    6,909.00 €          NaN
2   02/02/2024  Central  Dispositivos    David   11,420.00 €          NaN
3   03/02/2024  Central  Dispositivos    Karen   12,948.00 €          NaN
4   04/02/2024  Central      Sistemas    David   20,098.00 €          NaN
5   05/02/2024  Central      Sistemas    Karen   30,633.00 €          NaN
6   06/02/2024     Este    Accesorios      Ana    9,323.00 €          NaN
7   07/02/2024     Este    Accesorios    Lucas    7,667.00 €          NaN
8   08/02/2024     Este  Dispositivos      Ana   10,348.00 €          NaN
9   09/02/2024     Este  Dispositivos    Lucas    9,312.00 €          NaN
10  10/02/2024     Este      Sistemas      Ana   13,531.00 €          NaN
11  11/02/2024     Este      Sistemas    Lucas   13,374.00 €          NaN
12  12/02/2024    Oeste    Accesorios    Kevin    4,744.00 €          NaN
13  13/02/2024    Oeste    Accesorios     Sara    5,442.00 €          NaN
14  14/02/2024    Oeste  Dispositivos    Kevin   10,711.00 €          NaN
15  15/02/2024    Oeste  Dispositivos     Sara    8,780.00 €          NaN
16  16/02/2024    Oeste      Sistemas    Kevin   32,855.00 €          NaN
17  17/02/2024    Oeste      Sistemas     Sara   23,151.00 €          NaN

    Unnamed: 6  Unnamed: 7
0          NaN         NaN
1          NaN         NaN
2          NaN         NaN
3          NaN         NaN
4          NaN         NaN
5          NaN         NaN
6          NaN         NaN
7          NaN         NaN
8          NaN         NaN
9          NaN         NaN
10         NaN         NaN
11         NaN         NaN
12         NaN         NaN
13         NaN         NaN
14         NaN         NaN
15         NaN         NaN
16         NaN         NaN
17         NaN         NaN

In [16]:
example.head(4)

,Fecha,Region,Producto,Vendedor,Ventas,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,31/01/2024,Central,Accesorios,David,"8,287.00 €",NaN,NaN,NaN
1,01/02/2024,Central,Accesorios,Karen,"6,909.00 €",NaN,NaN,NaN
2,02/02/2024,Central,Dispositivos,David,"11,420.00 €",NaN,NaN,NaN
3,03/02/2024,Central,Dispositivos,Karen,"12,948.00 €",NaN,NaN,NaN

In [17]:
example.tail(2)

,Fecha,Region,Producto,Vendedor,Ventas,Unnamed: 5,Unnamed: 6,Unnamed: 7
16,16/02/2024,Oeste,Sistemas,Kevin,"32,855.00 €",NaN,NaN,NaN
17,17/02/2024,Oeste,Sistemas,Sara,"23,151.00 €",NaN,NaN,NaN

In [18]:
example.describe()

       Unnamed: 5  Unnamed: 6  Unnamed: 7
count         0.0         0.0         0.0
mean          NaN         NaN         NaN
std           NaN         NaN         NaN
min           NaN         NaN         NaN
25%           NaN         NaN         NaN
50%           NaN         NaN         NaN
75%           NaN         NaN         NaN
max           NaN         NaN         NaN